/* Тестовое задание по базе SQL
 * 
 * Пошаговая инструкция:
 * Скачать https://dbeaver.io/
 * Оставить чекбокс при запуске "создать тестовую базу данных"
 * Подключиться к базе данных
 * Язык = MySQL*/

--------------------------------------------------------------------------------------------------------------------------------------------------------
/*Задания*/
--------------------------------------------------------------------------------------------------------------------------------------------------------

/*1) Выбрать название плейлиста с максимальным количеством треков*/

/*2) Найти big boss, сотрудник, у которого нет руководителя*/

/*3) Вытянуть топ 10 названий альбомов по количеству треков, начиная с наибольшего. Назвать поле с названием альбома как
 'AlbumName', с количеством 'CountTrack'*/

/*4) Посчитать количество покупателей, чеков, сумму покупок, средний чек, сгруппировать по стране и городу. Подсветить
город с наибольшим средним чеком и с наибольшей суммой заказов, выделить их в отдельных полях MaxCheck и MaxRevenue,
принимает значение 'Yes' и 'No'*/

/*5) Предложить диаграмму БД сервиса по продаже музыки. Какие таблицы (БД, схемы), необходимо добавить для работы сервиса?
Как лучше сгруппировать данные, чтобы получить наибольшую производительность? При росте пользователе в 10 и более раз, за
счёт чего будет достигаться быстрота аналитических запросов?*/
